In [1]:
import pandas as pd
indian_weather = pd.DataFrame({
    'city':['mumbai','delhi','banglore'],
    'tempertaure':[32,45,50],
    'humidity':[50,80,90]
})
indian_weather

       city  tempertaure  humidity
0    mumbai           32        50
1     delhi           45        80
2  banglore           50        90

In [2]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [3]:
#Concatination Function
pd.concat([indian_weather,us_weather])

       city  tempertaure  humidity  temperature
0    mumbai         32.0        50          NaN
1     delhi         45.0        80          NaN
2  banglore         50.0        90          NaN
0  new york          NaN        68         21.0
1   chicago          NaN        65         14.0
2   orlando          NaN        75         35.0

In [4]:
#In the above DataFrame Output the index position is wrong SO
pd.concat([indian_weather,us_weather],ignore_index=True)

       city  tempertaure  humidity  temperature
0    mumbai         32.0        50          NaN
1     delhi         45.0        80          NaN
2  banglore         50.0        90          NaN
3  new york          NaN        68         21.0
4   chicago          NaN        65         14.0
5   orlando          NaN        75         35.0

In [5]:
#Using KEYS parameter
df=pd.concat([indian_weather,us_weather],keys=["india","us"])
df

             city  tempertaure  humidity  temperature
india 0    mumbai         32.0        50          NaN
      1     delhi         45.0        80          NaN
      2  banglore         50.0        90          NaN
us    0  new york          NaN        68         21.0
      1   chicago          NaN        65         14.0
      2   orlando          NaN        75         35.0

In [7]:
#getting data columns
df.loc['us']

       city  tempertaure  humidity  temperature
0  new york          NaN        68         21.0
1   chicago          NaN        65         14.0
2   orlando          NaN        75         35.0

In [8]:
df.loc["india"]

       city  tempertaure  humidity  temperature
0    mumbai         32.0        50          NaN
1     delhi         45.0        80          NaN
2  banglore         50.0        90          NaN

# Concatenation using index

In [9]:
temperature_df=pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
},index=[0,1,2])
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [10]:
windspeed_df=pd.DataFrame({
    "city": ["delhi","mumbai"],
    "windspeed": [7,12],
},index=[0,1])
windspeed_df

     city  windspeed
0   delhi          7
1  mumbai         12

In [11]:
#To concat strings in a sideways manner.
df=pd.concat([temperature_df,windspeed_df],axis=1)
df

       city  temperature    city  windspeed
0    mumbai           32   delhi        7.0
1     delhi           45  mumbai       12.0
2  banglore           30     NaN        NaN

# Concatenation using series

In [12]:
s=pd.Series(['humid','dry','wet'],name='event')
s

0    humid
1      dry
2      wet
Name: event, dtype: object

In [13]:
labels=[4,5,6,7]
df=pd.Series([temperature_df,s])
df

0           city  temperature
0    mumbai          ...
1    0    humid
1      dry
2      wet
Name: event, ...
dtype: object